"""
Треугольник существует только тогда, когда сумма любых двух его сторон больше третьей. Дано a, b, c —
стороны предполагаемого треугольника. Требуется сравнить длину каждого отрезка-стороны с суммой
двух других. Если хотя бы в одном случае отрезок окажется больше суммы двух других, то треугольника
с такими сторонами не существует. Отдельно сообщить является ли треугольник разносторонним,
равнобедренным или равносторонним.
"""
a = int(input('Введите длину 1-ого отрезка: '))
b = int(input('Введите длину 2-ого отрезка: '))
c = int(input('Введите длину 3-ого отрезка: '))

if a + b > c and a + c > b and b + c > a:
    if a == b == c:
        print('Равносторонний треугольник')
    elif a == b or a == c or b == c:
        print('Равнобедренный треугольник')
    else:
        print('Разносторонний треугольник')
else:
    print('Треугольника с такими сторонами не существует')

